cmsis-svd/cmsis-svd/data/Renesas/R7FA6M2.svd
                <register>
                    <name>ADCMPANSR1</name>
                    <description>A/D Compare Function Window A Channel Select Register 1</description>
                    <addressOffset>0x096</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CMPCHA20</name>
                            <description>AN020 Select</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Excludes AN020 from the compare window A target range.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Includes AN020  from the compare window A target range.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPCHA19</name>
                            <description>AN019 Select</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Excludes AN019 from the compare window A target range.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Includes AN019  from the compare window A target range.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPCHA18</name>
                            <description>AN018 Select</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Excludes AN018 from the compare window A target range.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Includes AN018  from the compare window A target range.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPCHA17</name>
                            <description>AN017 Select</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Excludes AN017 from the compare window A target range.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Includes AN017  from the compare window A target range.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPCHA16</name>
                            <description>AN016 Select</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Excludes AN016 from the compare window A target range.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Includes AN016  from the compare window A target range.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCMPLR0</name>
                    <description>A/D Compare Function Window A Comparison Condition Setting Register 0</description>
                    <addressOffset>0x098</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CMPLCHA07</name>
                            <description>Comparison condition of AN007</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA06</name>
                            <description>Comparison condition of AN006</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA05</name>
                            <description>Comparison condition of AN005</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA04</name>
                            <description>Comparison condition of AN004</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA03</name>
                            <description>Comparison condition of AN003</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA02</name>
                            <description>Comparison condition of AN002</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA01</name>
                            <description>Comparison condition of AN001</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA00</name>
                            <description>Comparison condition of AN000</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ADCMPLR1</name>
                    <description>A/D Compare Function Window A Comparison Condition Setting Register 1</description>
                    <addressOffset>0x09A</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CMPLCHA20</name>
                            <description>Comparison condition of AN020</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA19</name>
                            <description>Comparison condition of AN019</description>
                            <lsb>3</lsb>
                            <msb>3</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA18</name>
                            <description>Comparison condition of AN018</description>
                            <lsb>2</lsb>
                            <msb>2</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA17</name>
                            <description>Comparison condition of AN017</description>
                            <lsb>1</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>CMPLCHA16</name>
                            <description>Comparison condition of AN016</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ADCMPDR0 value &gt; A/D converted value (ADCMPCR.WCMPE=0) / A/D converted value &lt; ADCMPDR0 value or, ADCMPDR1 value &lt; A/D converted value (ADCMPCR.WCMPE=1)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ADCMPDR0 value &lt; A/D converted value (ADCMPCR.WCMPE=0) / A/DCMPDR0 value &lt; A/D converted value &lt; ADCMPDR1 value (ADCMPCR.WCMPE=1).</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
