cmsis-svd/cmsis-svd/data/Renesas/R7FA6M2.svd
                <register>
                    <name>CRCSAR</name>
                    <description>Snoop Address Register</description>
                    <addressOffset>0x0C</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>CRCSA</name>
                            <description>snoop address bitSet the I/O register address to snoop</description>
                            <lsb>0</lsb>
                            <msb>13</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0x0003</name>
                                    <description>SCI0.TDR</description>
                                    <value>0x0003</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0005</name>
                                    <description>SCI0.RDR</description>
                                    <value>0x0005</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0023</name>
                                    <description>SCI1.TDR</description>
                                    <value>0x0023</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0025</name>
                                    <description>SCI1.RDR</description>
                                    <value>0x0025</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0043</name>
                                    <description>SCI2.TDR</description>
                                    <value>0x0043</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0045</name>
                                    <description>SCI2.RDR</description>
                                    <value>0x0045</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0063</name>
                                    <description>SCI3.TDR</description>
                                    <value>0x0063</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0065</name>
                                    <description>SCI3.RDR</description>
                                    <value>0x0065</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0083</name>
                                    <description>SCI4.TDR</description>
                                    <value>0x0083</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0085</name>
                                    <description>SCI4.RDR</description>
                                    <value>0x0085</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x00A3</name>
                                    <description>SCI5.TDR</description>
                                    <value>0x00A3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x00A5</name>
                                    <description>SCI5.RDR</description>
                                    <value>0x00A5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x00C3</name>
                                    <description>SCI6.TDR</description>
                                    <value>0x00C3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x00C5</name>
                                    <description>SCI6.RDR</description>
                                    <value>0x00C5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x00E3</name>
                                    <description>SCI7.TDR</description>
                                    <value>0x00E3</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x00E5</name>
                                    <description>SCI7.RDR</description>
                                    <value>0x00E5</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0103</name>
                                    <description>SCI8.TDR</description>
                                    <value>0x0103</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0105</name>
                                    <description>SCI8.RDR</description>
                                    <value>0x0105</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0123</name>
                                    <description>SCI9.TDR</description>
                                    <value>0x0123</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>0x0125</name>
                                    <description>SCI9.RDR</description>
                                    <value>0x0125</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Settings other than above are prohibited.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
