cmsis-svd/cmsis-svd/data/Renesas/R7FA6M2.svd
                <register>
                    <name>SFMSKC</name>
                    <description>Clock Control Register</description>
                    <addressOffset>0x008</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000008</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SFMDTY</name>
                            <description>Selection of a duty ratio correction function for the SCK signal</description>
                            <lsb>5</lsb>
                            <msb>5</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Serial interface reference cycle selection (* Pay attention to the irregularity.)</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Delays the rising of the SCK signal by 0.5*PCLKA.(* Valid with PCLKA multiplied by an odd number)</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMDV</name>
                            <description>Serial interface reference cycle selection (* Pay attention to the irregularity.)NOTE: When PCLKA multiplied by an odd number is selected, the high-level width of the SCK signal is longer than the low-level width by 1 x PCLKA before duty ratio correction.</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>10000</name>
                                    <description>18 x PCLKA</description>
                                    <value>#10000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10001</name>
                                    <description>20 x PCLKA</description>
                                    <value>#10001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10010</name>
                                    <description>22 x PCLKA</description>
                                    <value>#10010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10011</name>
                                    <description>24 x PCLKA</description>
                                    <value>#10011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10100</name>
                                    <description>26 x PCLKA</description>
                                    <value>#10100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10101</name>
                                    <description>28 x PCLKA</description>
                                    <value>#10101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10110</name>
                                    <description>30 x PCLKA</description>
                                    <value>#10110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10111</name>
                                    <description>32 x PCLKA</description>
                                    <value>#10111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11000</name>
                                    <description>34 x PCLKA</description>
                                    <value>#11000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11001</name>
                                    <description>36 x PCLKA</description>
                                    <value>#11001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11010</name>
                                    <description>38 x PCLKA</description>
                                    <value>#11010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11011</name>
                                    <description>40 x PCLKA</description>
                                    <value>#11011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11100</name>
                                    <description>42 x PCLKA</description>
                                    <value>#11100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11101</name>
                                    <description>44 x PCLKA</description>
                                    <value>#11101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11110</name>
                                    <description>46 x PCLKA</description>
                                    <value>#11110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11111</name>
                                    <description>48 x PCLKA</description>
                                    <value>#11111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>( SFMDV + 2 ) x PCLKA </description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMSST</name>
                    <description>Status Register</description>
                    <addressOffset>0x00C</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x00000080</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>PFOFF</name>
                            <description>Prefetch function operation state</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The prefetch function is operating.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The prefetch function is not enabled or is not operating.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PFFUL</name>
                            <description>Prefetch buffer state</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>The prefetch buffer has a free space.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>The prefetch buffer is full.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>PFCNT</name>
                            <description>Number of bytes of prefetched dataRange: 00000 - 10010  (No combination other than the above is available.)</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00000</name>
                                    <description>Nodata has been prefetched.</description>
                                    <value>#00000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>others</name>
                                    <description>Data of (PFCNT) bytes hs been prefetched.</description>
                                    <isDefault>true</isDefault>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMCOM</name>
                    <description>Communication Port Register</description>
                    <addressOffset>0x010</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFF00</resetMask>
                    <fields>
                        <field>
                            <name>SFMD</name>
                            <description>Port for direct communication with the SPI bus.Input/output to and from this port is converted to an SPI bus cycle. This port is accessible in the direct communication mode (DCOM=1) only.Access to this port is ignored in the ROM access mode.</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMCMD</name>
                    <description>Communication Mode Control Register</description>
                    <addressOffset>0x014</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>DCOM</name>
                            <description>Selection of a mode of communication with the SPI bus</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ROM access mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Direct communication mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMCST</name>
                    <description>Communication Status Register</description>
                    <addressOffset>0x018</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>EROMR</name>
                            <description>Status of ROM access detection in the direct communication modeNOTE: Writing of 0 only is possible. Writing of 1 is ignored.</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <modifiedWriteValues>zeroToClear</modifiedWriteValues>
                            <readAction>modify</readAction>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>ROM access is not detected in direct communication mode</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>ROM access is detected in direct communication mode</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>COMBSY</name>
                            <description>SPI bus cycle completion state in direct communication</description>
                            <lsb>0</lsb>
                            <msb>0</msb>
                            <access>read-only</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>There is no serial transfer being processed.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>There is a serial transfer being processed.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMSIC</name>
                    <description>Instruction Code Register</description>
                    <addressOffset>0x020</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SFMCIC</name>
                            <description>Serial ROM instruction code to substitute</description>
                            <lsb>0</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SFMSAC</name>
                    <description>Address Mode Control Register</description>
                    <addressOffset>0x024</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x00000002</resetValue>
                    <resetMask>0xFFFFFFFF</resetMask>
                    <fields>
                        <field>
                            <name>SFM4BC</name>
                            <description>Selection of a default instruction code, when Serial Interface address width is selected 4 bytes.</description>
                            <lsb>4</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Does not use 4 Byte address read Instruction code</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Use 4 Byte address read Instruction code</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>SFMAS</name>
                            <description>Selection the number of address bits of the serial interface</description>
                            <lsb>0</lsb>
                            <msb>1</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00</name>
                                    <description>1byte</description>
                                    <value>#00</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01</name>
                                    <description>2bytes</description>
                                    <value>#01</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>3bytes</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>4 bytes</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
