cmsis-svd/cmsis-svd/data/Renesas/R7FA6M2.svd
                                <enumeratedValue>
                                    <name>10</name>
                                    <description>Set GTIOCA pin to 0 on output disable</description>
                                    <value>#10</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11</name>
                                    <description>Set GTIOCA pin to 1 on output disable.</description>
                                    <value>#11</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OAE</name>
                            <description>GTIOCA Pin Output Enable</description>
                            <lsb>8</lsb>
                            <msb>8</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Disable output</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Enable output.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OAHLD</name>
                            <description>GTIOCA Pin Output Setting at the Start/Stop Count</description>
                            <lsb>7</lsb>
                            <msb>7</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Set GTIOCA pin output level on counting start and stop based on the register setting.</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Retain GTIOCA pin output level on counting start and stop</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>OADFLT</name>
                            <description>GTIOCA Pin Output Value Setting at the Count Stop</description>
                            <lsb>6</lsb>
                            <msb>6</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>0</name>
                                    <description>Output low on GTIOCA pin when counting stops</description>
                                    <value>#0</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>1</name>
                                    <description>Output high on GTIOCA pin when counting stops.</description>
                                    <value>#1</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                        <field>
                            <name>GTIOA</name>
                            <description>GTIOCA Pin Function Select</description>
                            <lsb>0</lsb>
                            <msb>4</msb>
                            <access>read-write</access>
                            <enumeratedValues>
                                <enumeratedValue>
                                    <name>00000</name>
                                    <description>Initial output is Low. Output retained at cycle end. Output retained at GTCCRA compare match.</description>
                                    <value>#00000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00001</name>
                                    <description>Initial output is Low. Output retained at cycle end. Low output at GTCCRA compare match.</description>
                                    <value>#00001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00010</name>
                                    <description>Initial output is Low. Output retained at cycle end. High output at GTCCRA compare match.</description>
                                    <value>#00010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00011</name>
                                    <description>Initial output is Low. Output retained at cycle end. Output toggled at GTCCRA compare match.</description>
                                    <value>#00011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00100</name>
                                    <description>Initial output is Low. Low output at cycle end. Output retained at GTCCRA compare match.</description>
                                    <value>#00100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00101</name>
                                    <description>Initial output is Low. Low output at cycle end. Low output at GTCCRA compare match.</description>
                                    <value>#00101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00110</name>
                                    <description>Initial output is Low. Low output at cycle end. High output at GTCCRA compare match.</description>
                                    <value>#00110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>00111</name>
                                    <description>Initial output is Low. Low output at cycle end. Output toggled at GTCCRA compare match.</description>
                                    <value>#00111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01000</name>
                                    <description>Initial output is Low. High output at cycle end. Output retained at GTCCRA compare match.</description>
                                    <value>#01000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01001</name>
                                    <description>Initial output is Low. High output at cycle end. Low output at GTCCRA compare match.</description>
                                    <value>#01001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01010</name>
                                    <description>Initial output is Low. High output at cycle end. High output at GTCCRA compare match.</description>
                                    <value>#01010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01011</name>
                                    <description>Initial output is Low. High output at cycle end. Output toggled at GTCCRA compare match.</description>
                                    <value>#01011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01100</name>
                                    <description>Initial output is Low. Output toggled at cycle end. Output retained at GTCCRA compare match.</description>
                                    <value>#01100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01101</name>
                                    <description>Initial output is Low. Output toggled at cycle end. Low output at GTCCRA compare match.</description>
                                    <value>#01101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01110</name>
                                    <description>Initial output is Low. Output toggled at cycle end. High output at GTCCRA compare match.</description>
                                    <value>#01110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>01111</name>
                                    <description>Initial output is Low. Output toggled at cycle end. Output toggled at GTCCRA compare match.</description>
                                    <value>#01111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10000</name>
                                    <description>Initial output is High. Output retained at cycle end. Output retained at GTCCRA compare match.</description>
                                    <value>#10000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10001</name>
                                    <description>Initial output is High. Output retained at cycle end. Low output at GTCCRA compare match.</description>
                                    <value>#10001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10010</name>
                                    <description>Initial output is High. Output retained at cycle end. High output at GTCCRA compare match.</description>
                                    <value>#10010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10011</name>
                                    <description>Initial output is High. Output retained at cycle end. Output toggled at GTCCRA compare match.</description>
                                    <value>#10011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10100</name>
                                    <description>Initial output is High. Low output at cycle end. Output retained at GTCCRA compare match.</description>
                                    <value>#10100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10101</name>
                                    <description>Initial output is High. Low output at cycle end. Low output at GTCCRA compare match.</description>
                                    <value>#10101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10110</name>
                                    <description>Initial output is High. Low output at cycle end. High output at GTCCRA compare match.</description>
                                    <value>#10110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>10111</name>
                                    <description>Initial output is High. Low output at cycle end. Output toggled at GTCCRA compare match.</description>
                                    <value>#10111</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11000</name>
                                    <description>Initial output is High. High output at cycle end. Output retained at GTCCRA compare match.</description>
                                    <value>#11000</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11001</name>
                                    <description>Initial output is High. High output at cycle end. Low output at GTCCRA compare match.</description>
                                    <value>#11001</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11010</name>
                                    <description>Initial output is High. High output at cycle end. High output at GTCCRA compare match.</description>
                                    <value>#11010</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11011</name>
                                    <description>Initial output is High. High output at cycle end. Output toggled at GTCCRA compare match.</description>
                                    <value>#11011</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11100</name>
                                    <description>Initial output is High. Output toggled at cycle end. Output retained at GTCCRA compare match.</description>
                                    <value>#11100</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11101</name>
                                    <description>Initial output is High. Output toggled at cycle end. Low output at GTCCRA compare match.</description>
                                    <value>#11101</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11110</name>
                                    <description>Initial output is High. Output toggled at cycle end. High output at GTCCRA compare match.</description>
                                    <value>#11110</value>
                                </enumeratedValue>
                                <enumeratedValue>
                                    <name>11111</name>
                                    <description>Initial output is High. Output toggled at cycle end. Output toggled at GTCCRA compare match.</description>
                                    <value>#11111</value>
                                </enumeratedValue>
                            </enumeratedValues>
                        </field>
                    </fields>
                </register>
